In [35]:
import pandas as pd
#from io import StringIO
data_dict = {'A': pd.Series([1.0, 5.0, 0.0],   index=[0, 1, 2]),
             'B': pd.Series([2.0, 6.0, 11.0],  index=[0, 1, 2]), 
             'C': pd.Series([3.0,      12.0],  index=[0,    2]),
             'D': pd.Series([4,   8,       ],  index=[0, 1   ])
            }


df = pd.DataFrame(data=data_dict)

In [36]:
df

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   NaN  8.0
2  0.0  11.0  12.0  NaN

In [37]:
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False  False   True  False
2  False  False  False   True

In [39]:
df.isnull().sum()

A    0
B    0
C    1
D    1
dtype: int64

In [40]:
df.values

array([[  1.,   2.,   3.,   4.],
       [  5.,   6.,  nan,   8.],
       [  0.,  11.,  12.,  nan]])

In [41]:
# rows with missing values can be dropped 
df.dropna()

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [42]:
# drop columns that have at least one NaN in any row by setting the axis 
# argument to 1
df.dropna(axis=1)

     A     B
0  1.0   2.0
1  5.0   6.0
2  0.0  11.0

In [43]:
df.dropna(axis=0)

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [44]:
# only drop rows where all columns are NaN
df.dropna(how='all')

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   NaN  8.0
2  0.0  11.0  12.0  NaN

In [45]:
# drop rows that do not have at least 4 non-NaN values
df.dropna(thresh=4)

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [46]:
# only drop rows where NaN appear in specific columns (here: 'C')
df.dropna(subset=['C'])

     A     B     C    D
0  1.0   2.0   3.0  4.0
2  0.0  11.0  12.0  NaN

In [30]:
df

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   NaN  8.0
2  0.0  11.0  12.0  NaN

In [47]:
from sklearn.preprocessing import Imputer
imputer = Imputer(missing_values='NaN', strategy='mean', axis=0)
imputer = imputer.fit(df)
imputed_data = imputer.transform(df.values)
imputed_data

array([[  1. ,   2. ,   3. ,   4. ],
       [  5. ,   6. ,   7.5,   8. ],
       [  0. ,  11. ,  12. ,   6. ]])

In [32]:

imputer = Imputer(missing_values='NaN', strategy='mean', axis=1)
imputer = imputer.fit(df)
imputed_data = imputer.transform(df.values)
imputed_data

array([[  1.        ,   2.        ,   3.        ,   4.        ],
       [  5.        ,   6.        ,   6.33333333,   8.        ],
       [  0.        ,  11.        ,  12.        ,   7.66666667]])

In [33]:
df = pd.DataFrame([
['green', 'M', 10.1, 'class1'],
['red', 'L', 13.5, 'class2'],
['blue', 'XL', 15.3, 'class1']])
df

       0   1     2       3
0  green   M  10.1  class1
1    red   L  13.5  class2
2   blue  XL  15.3  class1

In [34]:
df.columns = ['color', 'size', 'price', 'classlabel']

In [30]:
df

   color size  price classlabel
0  green    M   10.1     class1
1    red    L   13.5     class2
2   blue   XL   15.3     class1